{
  "todos": [
    {
      "id": 1,
      "title": "Разработка нового функционала",
      "text": "Создать новый функционал для обработки платежей в приложении. Необходимо учесть интеграцию с API платежной системы для обеспечения безопасности и удобства пользователей.",
      "status": "in_work",
      "isAttach": true
    },
    {
      "id": 2,
      "title": "Обновление документации",
      "text": "Обновить документацию для пользователей, добавив раздел о новых функциях и исправлениях ошибок. Это поможет пользователям лучше понять продукт.",
      "status": "resolved",
      "isAttach": false
    },
    {
      "id": 3,
      "title": "Тестирование версии 2.0",
      "text": "Провести тестирование новой версии приложения 2.0, выявить и задокументировать ошибки, чтобы обеспечить качественный релиз и удовлетворение пользователей.",
      "status": "to_do",
      "isAttach": true
    },
    {
      "id": 4,
      "title": "Подготовка к запуску",
      "text": "Подготовить маркетинговые материалы и стратегию запуска нового продукта на рынок. Важно обеспечить максимальную видимость и интерес к продукту.",
      "status": "to_do",
      "isAttach": false
    },
    {
      "id": 5,
      "title": "Анализ пользовательских отзывов",
      "text": "Собрать и проанализировать отзывы пользователей о текущей версии приложения для улучшения UX. Это поможет в дальнейшем развитии продукта.",
      "status": "in_work",
      "isAttach": true
    },
    {
      "id": 6,
      "title": "Настройка CI/CD",
      "text": "Настроить процесс непрерывной интеграции и доставки для автоматизации сборки и тестирования. Это значительно ускорит разработку и улучшит качество кода.",
      "status": "resolved",
      "isAttach": false
    },
    {
      "id": 7,
      "title": "Оптимизация базы данных",
      "text": "Оптимизировать запросы к базе данных для повышения производительности приложения. Это критически важно для обеспечения быстродействия продукта.",
      "status": "in_work",
      "isAttach": true
    },
    {
      "id": 8,
      "title": "Обучение сотрудников",
      "text": "Провести обучение для новых сотрудников по использованию системы. Это поможет им быстрее адаптироваться и повысит общую продуктивность команды.",
      "status": "cancelled",
      "isAttach": false
    },
    {
      "id": 9,
      "title": "Создание резервной копии",
      "text": "Создать резервную копию всех данных приложения перед обновлением. Это необходимо для предотвращения потери данных в случае ошибки.",
      "status": "resolved",
      "isAttach": false
    },
    {
      "id": 10,
      "title": "Разработка мобильного приложения",
      "text": "Начать разработку мобильной версии приложения для iOS и Android. Это расширит аудиторию и повысит доступность продукта для пользователей.",
      "status": "to_do",
      "isAttach": true
    },
    {
      "id": 11,
      "title": "Аудит безопасности",
      "text": "Провести аудит безопасности приложения и устранить выявленные уязвимости. Это поможет защитить данные пользователей и повысить доверие к продукту.",
      "status": "in_work",
      "isAttach": false
    },
    {
      "id": 12,
      "title": "Обновление серверного ПО",
      "text": "Обновить серверное программное обеспечение до последней версии для повышения безопасности и производительности системы. Это важный шаг для обеспечения стабильности.",
      "status": "resolved",
      "isAttach": true
    },
    {
      "id": 13,
      "title": "Создание пользовательских отчетов",
      "text": "Разработать функционал для создания пользовательских отчетов в приложении. Это позволит пользователям лучше анализировать свои данные и принимать решения.",
      "status": "to_do",
      "isAttach": false
    },
    {
      "id": 14,
      "title": "Миграция на облачное хранилище",
      "text": "Перенести данные в облачное хранилище для повышения доступности и надежности. Это обеспечит защиту данных и их доступность в любое время.",
      "status": "in_work",
      "isAttach": true
    },
    {
      "id": 15,
      "title": "Тестирование производительности",
      "text": "Провести тестирование производительности приложения под нагрузкой. Это необходимо для выявления узких мест и улучшения пользовательского опыта.",
      "status": "to_do",
      "isAttach": false
    },
    {
      "id": 16,
      "title": "Анализ конкурентов",
      "text": "Провести анализ конкурентов и их функционала для улучшения нашего продукта. Это поможет выявить сильные и слабые стороны нашего предложения.",
      "status": "resolved",
      "isAttach": true
    },
    {
      "id": 17,
      "title": "Обновление интерфейса",
      "text": "Обновить пользовательский интерфейс приложения для улучшения UX. Это сделает приложение более привлекательным и удобным для пользователей.",
      "status": "in_work",
      "isAttach": false
    },
    {
      "id": 18,
      "title": "Подготовка отчетности",
      "text": "Подготовить квартальный отчет о выполненных задачах и достигнутых результатах. Это поможет команде оценить свою работу и наметить планы на будущее.",
      "status": "resolved",
      "isAttach": true
    },
    {
      "id": 19,
      "title": "Сбор требований от клиентов",
      "text": "Собрать требования от клиентов для нового функционала. Это поможет лучше понять потребности пользователей и улучшить продукт.",
      "status": "to_do",
      "isAttach": false
    },
    {
      "id": 20,
      "title": "Разработка API",
      "text": "Разработать API для интеграции с внешними сервисами. Это расширит возможности приложения и позволит легко подключать сторонние решения.",
      "status": "in_work",
      "isAttach": true
    },
    {
      "id": 21,
      "title": "Обновление зависимостей",
      "text": "Обновить все зависимости проекта до последних стабильных версий. Это важно для повышения безопасности и стабильности приложения.",
      "status": "resolved",
      "isAttach": false
    },
    {
      "id": 22,
      "title": "Проведение опроса пользователей",
      "text": "Провести опрос среди пользователей для получения обратной связи. Это поможет выявить проблемные области и улучшить продукт.",
      "status": "to_do",
      "isAttach": true
    },
    {
      "id": 23,
      "title": "Кросс-браузерное тестирование",
      "text": "Провести тестирование приложения в различных браузерах, чтобы убедиться в его корректной работе для всех пользователей.",
      "status": "in_work",
      "isAttach": false
    },
    {
      "id": 24,
      "title": "Создание FAQ",
      "text": "Создать раздел часто задаваемых вопросов для пользователей. Это поможет снизить нагрузку на службу поддержки и улучшить пользовательский опыт.",
      "status": "resolved",
      "isAttach": false
    },
    {
      "id": 25,
      "title": "Поддержка пользователей",
      "text": "Обеспечить поддержку пользователей через чат и электронную почту. Это важно для быстрого решения проблем и повышения удовлетворенности клиентов.",
      "status": "in_work",
      "isAttach": true
    }
  ]
}
